# Explore Hunter Origin Station 2021-2024
`datasets/MTA_Subway_Origin-Destination_2021_Hunter_Origin.csv`

`datasets/MTA_Subway_Origin-Destination_2022_Hunter_Origin.csv`

`datasets/MTA_Subway_Origin-Destination_2023_Hunter_Origin.csv`

`datasets/MTA_Subway_Origin-Destination_2024_Hunter_Origin.csv`
* Full MTA Subway Origin-Destination 2021-2024 Dataset queried for Hunter College Origin Station

In 2021, most students did remote learning because of the COVID-19 pandemic. Those who took the train were primarily essential workers. We can hypothesize that in the 2021 dataset, the ridership data are mostly non-students. Perhaps that by finding an increase in certain station destinations post 2021, we can say with some confidence that those are student stops.

In [2]:
from utils import *
import pandas as pd

In [3]:
# load in all the csvs
hunter_origin_2021 = pd.read_csv("datasets/MTA_Subway_Origin-Destination_2021_Hunter_Origin.csv")
hunter_origin_2022 = pd.read_csv("datasets/MTA_Subway_Origin-Destination_2022_Hunter_Origin.csv")
hunter_origin_2023 = pd.read_csv("datasets/MTA_Subway_Origin-Destination_2023_Hunter_Origin.csv")
hunter_origin_2024 = pd.read_csv("datasets/MTA_Subway_Origin-Destination_2024_Hunter_Origin.csv")

In [9]:
# combine all the dataframes
hunter_origin_total = pd.concat([hunter_origin_2021, hunter_origin_2022, hunter_origin_2023, hunter_origin_2024])

In [4]:
top_station_destinations(hunter_origin_2021, 5)

    Destination Station Complex Name  Count
357                  Parkchester (6)   1719
279  Grand Central-42 St (S,4,5,6,7)   1706
80                   3 Av-138 St (6)   1687
18                    125 St (4,5,6)   1684
137                    86 St (4,5,6)   1682

In [5]:
top_station_destinations(hunter_origin_2022, 5)

    Destination Station Complex Name  Count
18                    125 St (4,5,6)   1805
279  Grand Central-42 St (S,4,5,6,7)   1757
137                    86 St (4,5,6)   1750
357                  Parkchester (6)   1737
12                        116 St (6)   1735

In [6]:
top_station_destinations(hunter_origin_2023, 5)

       Destination Station Complex Name  Count
279     Grand Central-42 St (S,4,5,6,7)   1806
357                     Parkchester (6)   1744
18                       125 St (4,5,6)   1737
319  Lexington Av-53 St (E,M)/51 St (6)   1724
12                           116 St (6)   1714

In [7]:
top_station_destinations(hunter_origin_2024, 5)

       Destination Station Complex Name  Count
279     Grand Central-42 St (S,4,5,6,7)   1946
18                       125 St (4,5,6)   1878
137                       86 St (4,5,6)   1872
319  Lexington Av-53 St (E,M)/51 St (6)   1845
357                     Parkchester (6)   1842

In [10]:
top_station_destinations(hunter_origin_total, 5)

    Destination Station Complex Name  Count
279  Grand Central-42 St (S,4,5,6,7)   7215
18                    125 St (4,5,6)   7104
357                  Parkchester (6)   7042
137                    86 St (4,5,6)   7006
12                        116 St (6)   6909